---
kind: type
id: T:Autodesk.Revit.DB.ScheduleFieldType
source: html/9888db7d-00d0-4fd7-a1a9-cdd1fb5fce16.htm
---
# Autodesk.Revit.DB.ScheduleFieldType

The type of data displayed in a schedule field.

## Syntax (C#)
```csharp
public enum ScheduleFieldType
```